cases/flexible-rigid/rigid/system/controlDict
FoamFile { format ascii; class dictionary; object controlDict; }
#include "../../common/controlDict"
