cases/flexible-rigid/rigid/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    oilInlet
    {
        type            patch;
        nFaces          100;
        startFace       75500;
    }
    waterInlet
    {
        type            patch;
        nFaces          100;
        startFace       75600;
    }
    outlet
    {
        type            patch;
        nFaces          100;
        startFace       75700;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          5300;
        startFace       75800;
    }
    bottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2700;
        startFace       81100;
    }
    membrane
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2700;
        startFace       83800;
    }
)

// ************************************************************************* //
