cases/flexible-rigid/rigid/constant/momentumTransport
FoamFile { format ascii; class dictionary; object momentumTransport; }
#include "../../common/momentumTransport"
