cases/flexible-rigid/rigid/constant/g
FoamFile { format ascii; class uniformDimensionedVectorField; object g; }
#include "../../common/g"
