cases/flexible-rigid/rigid/constant/phaseProperties
FoamFile { format ascii; class dictionary; object phaseProperties; }
#include "../../common/phaseProperties"
