cases/flexible-rigid/rigid/constant/physicalProperties.water
FoamFile { format ascii; class dictionary; object physicalProperties.water; }
#include "../../common/physicalProperties.water"
