cases/flexible-rigid/rigid/0/U
FoamFile { format ascii; class volVectorField; object U; }
Qc 3.90355e-11;
Qd 1.95178e-11;
#include "../../common/U"
