cases/flexible-rigid/rigid/0/p_rgh
FoamFile { format ascii; class volScalarField; object p_rgh; }
#include "../../common/p_rgh"
