cases/flexible-rigid/rigid/0/alpha.water
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField   nonuniform List<scalar> 
27000
(
0
0
0
0
0
0
0
0
...
)
;

boundaryField
{
    oilInlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    waterInlet
    {
        type            fixedValue;
        value           uniform 1;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
    walls
    {
        type            contactAngle;
        theta0          96.91;
        limit           gradient;
        value           nonuniform List<scalar> 
5300
(
0
0
0
0
0
0
0
0
...
)
;
    }
    bottom
    {
        type            contactAngle;
        theta0          96.91;
        limit           gradient;
        value           nonuniform List<scalar> 
2700
(
0
0
0
0
0
0
0
0
...
)
;
    }
    membrane
    {
        type            contactAngle;
        theta0          96.91;
        limit           gradient;
        value           nonuniform List<scalar> 
2700
(
0
0
0
0
0
0
0
0
...
)
;
    }
}


// ************************************************************************* //
