cases/flexible-rigid/rigid/system/fvSchemes
FoamFile { format ascii; class dictionary; object fvSchemes; }
#include "../../common/fvSchemes"
