cases/flexible-rigid/rigid/system/fvSolution
FoamFile { format ascii; class dictionary; object fvSolution; }
#include "../../common/fvSolution"
