cases/flexible-rigid/rigid/system/setFieldsDict
FoamFile { format ascii; class dictionary; object setFieldsDict; }
#include "../../common/setFieldsDict"
